//Функция СредняяСтоимостьПродаваемыхЦБ(Документ)  Экспорт

//		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//	// Данный фрагмент построен конструктором.
//	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	ЗаявкаНаПродажуЦБИнструменты.Инструмент КАК Инструмент
//		|ПОМЕСТИТЬ Инструменты
//		|ИЗ
//		|	Документ.ЗаявкаНаПродажуЦБ.Инструменты КАК ЗаявкаНаПродажуЦБИнструменты
//		|ГДЕ
//		|	ЗаявкаНаПродажуЦБИнструменты.Ссылка = &Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвижениеЦБОстатки.Инструмент КАК Инструмент,
//		|	ДвижениеЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
//		|	ДвижениеЦБОстатки.СуммаОстаток КАК СуммаОстаток,
//		|	ВЫБОР
//		|		КОГДА ДвижениеЦБОстатки.КоличествоОстаток = 0
//		|			ТОГДА 0
//		|		ИНАЧЕ ДвижениеЦБОстатки.СуммаОстаток / ДвижениеЦБОстатки.КоличествоОстаток
//		|	КОНЕЦ КАК СрСтоимость
//		|ИЗ
//		|	РегистрНакопления.ДвижениеЦБ.Остатки(
//		|			&ДатаПродажи,
//		|			БрокерскийСчет = &БрокерскийСчет
//		|				И Инструмент В
//		|					(ВЫБРАТЬ
//		|						Инструменты.Инструмент КАК Инструмент
//		|					ИЗ
//		|						Инструменты КАК Инструменты)) КАК ДвижениеЦБОстатки";
//	
//	Запрос.УстановитьПараметр("ДатаПродажи", КонецДня(Документ.Дата));
//	Запрос.УстановитьПараметр("БрокерскийСчет", Документ.БрокерскийСчет);
//	Запрос.УстановитьПараметр("Ссылка",Документ);	
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	СрСтоимостьЦБ = Новый Соответствие;
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		СрСтоимостьЦБ.Вставить(ВыборкаДетальныеЗаписи.Инструмент,ВыборкаДетальныеЗаписи.СрСтоимость);

//	КонецЦикла;
//	
//	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА    
//	
//	Возврат СрСтоимостьЦБ;
//	

//КонецФункции // СредняяСтоимостьПродаваемхЦБ(МассивЦБ)()
