
&НаКлиенте
Процедура ТекущаяЗадолженностьДоступнаяСуммаПриИзменении(Элемент)
	РасчетИтоговойСуммы ();
КонецПроцедуры    

&НаКлиенте
Процедура ТекущаяЗадолженностьСуммаОстаткаПриИзменении(Элемент)
	РасчетИтоговойСуммы ();
КонецПроцедуры

&НаКлиенте
Процедура РасчетИтоговойСуммы ()
	ТекущиеДанные = Элементы.ТекущаяЗадолженность.ТекущиеДанные;
	ТекущиеДанные.ИтоговаяСумма = ТекущиеДанные.ДоступнаяСумма - ТекущиеДанные.СуммаОстатка;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РассчитатьИтогДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	РассчитатьИтогДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогДокумента()

	Объект.ИтоговыйБаланс = Объект.ТекущийОстаок.Итог("Сумма") - Объект.ТекущаяЗадолженность.Итог("ИтоговаяСумма");

КонецПроцедуры // РассчитатьИтогДокумента()
