
&НаСервере
Процедура ИнструментыИнструментПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИнструментПриИзменении(Элемент)  
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.КоличествоЦБВЛоте = ПолучитьКоличествоЦБВЛоте(ТекСтр.Инструмент);
	ИнструментыИнструментПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЦБВЛоте(ЦБ)
	
	Возврат ЦБ.КоличествоЦБВЛоте; 	
	
КонецФункции // ПолучитьКоличествоЦБВЛоте()

&НаКлиенте
Процедура ИнструментыКоличествоЛотовПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.КоличествоЦБ = ТекСтр.КоличествоЛотов  * ТекСтр.КоличествоЦБВЛоте;  
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыЦенаПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.КоличествоЦБ;  
	ИнструментыСуммаПриИзменении(Элемент); 
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда  
		
		ЗначениеКомиссий = Новый Структура;
		ЗначениеКомиссиийНаСервере(ЗначениеКомиссий);
		Элемент.ТекущиеДанные.КомиссияБрокера = ЗначениеКомиссий.КомиссияБрокера;
		Элемент.ТекущиеДанные.КомиссияБиржи = ЗначениеКомиссий.КомиссияБиржи;
		
	КонецЕсли;  	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗначениеКомиссиийНаСервере(ЗначениеКомиссиий)

	ЗначениеКомиссиий = ОбщийКэшируемыйМодуль.ПолучитьКомиссииБрокраИБиржиПоСчету(Объект.БрокерскийСчет);	

КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссииБрокера = ТекСтр.Сумма * ТекСтр.КомиссияБрокера / 100;
	ТекСтр.СуммаКомиссииБиржи   = ТекСтр.Сумма * ТекСтр.КомиссияБиржи /100;

КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаКомиссииБрокераПриИзменении(Элемент)
	
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииСуммыКомиссиий(Элемент)

	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссии = ТекСтр.СуммаКомиссииБрокера  + ТекСтр. СуммаКомиссииБиржи;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаКомиссииБиржиПриИзменении(Элемент)
	
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыКомиссияБрокераПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссииБрокера = ТекСтр.Сумма * ТекСтр.КомиссияБрокера / 100;  
	ПриИзмененииСуммыКомиссиий(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыКомиссияБиржыПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссииБиржи   = ТекСтр.Сумма * ТекСтр.КомиссияБиржи /100;  
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
КонецПроцедуры
