
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДвижениеДСНаСчете Расход
	Движения.ДвижениеДСНаСчете.Записывать = Истина;
	Движение = Движения.ДвижениеДСНаСчете.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	Движение.Сумма = СуммаДокумента;
	Движение.ЗаСчетПрибыли = Ложь;
	
	// регистр ДвижениеЦБ Приход
	Движения.ДвижениеЦБ.Записывать = Истина;
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.ДвижениеЦБ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Количество = ТекСтрокаИнструменты.КоличествоЦБ;
		Движение.Сумма = ТекСтрокаИнструменты.Сумма;
	КонецЦикла;
	
	// регистр КомиссияБрокера Приход
	Движения.КомиссияБрокера.Записывать = Истина;
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.КомиссияБрокера.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Сумма = ТекСтрокаИнструменты.СуммаКомиссииБрокера;
	КонецЦикла;
	
	// регистр КомиссияБиржи Приход
	Движения.КомиссияБиржи.Записывать = Истина;
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.КомиссияБиржи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Сумма = ТекСтрокаИнструменты.СуммаКомиссииБиржи;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Инструменты.Итог("Сумма") 
					+  Инструменты.Итог("СуммаКомиссииБрокера")
					+ Инструменты.Итог("СуммаКомиссииБиржи");
	
КонецПроцедуры



