Процедура ЗагрузитьИзФайла(ИмяФайла) Экспорт
	
    ФайлДанных = Новый ТекстовыйДокумент;
	
	ФайлДанных.Прочитать(ИмяФайла);
	
	КоличествоСтрок = ФайлДанных.КоличествоСтрок()-2;
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период");
	ТЗ.Колонки.Добавить("КодЦБ");
	ТЗ.Колонки.Добавить("ЦенаЗакрытия");
	Для СчСтрок = 4 По КоличествоСтрок Цикл
		СтрокаДанных = ФайлДанных.ПолучитьСтроку(СчСтрок);
		СтрокаДанныхМассив = СтрРазделить(СтрокаДанных,";",Истина);
		Если ЗначениеЗаполнено(СтрокаДанныхМассив[7]) Тогда
			Попытка
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.Период = Дата(СтрЗаменить(СтрокаДанныхМассив[1],"-",""));
				СтрокаТЗ.КодЦБ = СтрокаДанныхМассив[0];
				СтрокаТЗ.ЦенаЗакрытия = СтрокаДанныхМассив[7]; 
			Исключение
			КонецПопытки;			
		КонецЕсли;			
	КонецЦикла;
	
	//Если ТЗ.Количество() Тогда
	//	НаборЗаписей = РегистрыСведений.КотировкиЦБ.СоздатьНаборЗаписей();
	//	НаборЗаписей.Загрузить(ТЗ);
	//	НаборЗаписей.Записать();
	//КонецЕсли;	
	Для каждого Строка Из ТЗ Цикл
		МенеджерЗаписи  = РегистрыСведений.КотировкиЦБ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Строка);
		МенеджерЗаписи.Записать();
	КонецЦикла;                                      
КонецПроцедуры
