
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//МассивЦб = Новый Массив;
	//МассивЦб = Инструменты.ВыгрузитьКолонку("Инструмент");  
	//СрСтоимостьПродаваемыхЦБ = Новый Соответствие;
	//СрСтоимостьПродаваемыхЦБ = ОбщийМодульРасчета.СредняяСтоимостьПродаваемыхЦБ(Ссылка); 
		
	Движения.ДвижениеДСНаСчете.Записывать = Истина;  
	Движения.ДвижениеЦБ.Записывать = Истина;
	Движения.КомиссияБрокера.Записывать = Истина;
    Движения.КомиссияБиржи.Записывать = Истина;
	Движения.Прибыль.Записывать = Истина;
	Движения.Записать();  
	
	// регистр ДвижениеДСНаСчете Расход
	Движения.ДвижениеДСНаСчете.Записывать = Истина;
	Движение = Движения.ДвижениеДСНаСчете.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	Движение.Сумма = СуммаДокумента;
	Движение.ЗаСчетПрибыли = Ложь;
	
	
	// регистр ДвижениеЦБ  и  Регистр прибыли 
	Движения.ДвижениеЦБ.Записывать = Истина;
	Движения.Прибыль.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДвижениеЦБ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("БрокерскийСчет",БрокерскийСчет);
	ЭлементБлокировки.ИсточникДанных = Инструменты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Инструмент","Инструмент");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаПродажуЦБИнструменты.КоличествоЦБ КАК КоличествоЦБ,
		|	ЗаявкаНаПродажуЦБИнструменты.Инструмент КАК Инструмент,
		|	ЗаявкаНаПродажуЦБИнструменты.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТИнструменты
		|ИЗ
		|	Документ.ЗаявкаНаПродажуЦБ.Инструменты КАК ЗаявкаНаПродажуЦБИнструменты
		|ГДЕ
		|	ЗаявкаНаПродажуЦБИнструменты.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Инструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТИнструменты.КоличествоЦБ, 0) КАК КоличествоЦБ,
		|	ЕСТЬNULL(ДвижениеЦБОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ДвижениеЦБОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ВТИнструменты.Сумма, 0) КАК Сумма,
		|	ВТИнструменты.Инструмент КАК Инструмент
		|ИЗ
		|	ВТИнструменты КАК ВТИнструменты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеЦБ.Остатки(&МоментВремени, БрокерскийСчет = &БрокерскийСчет) КАК ДвижениеЦБОстатки
		|		ПО ВТИнструменты.Инструмент = ДвижениеЦБОстатки.Инструмент";
	
	Запрос.УстановитьПараметр("БрокерскийСчет", БрокерскийСчет);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоЦБ=Выборка.КоличествоОстаток Тогда   	
			СебеСтоимость = Выборка.СуммаОстаток;  	
		Иначе 
			СебеСтоимость = Выборка.СуммаОстаток*Выборка.КоличествоЦБ/Выборка.КоличествоОстаток; 
		КонецЕсли; 
	
		Движение = Движения.ДвижениеЦБ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = Выборка.Инструмент;
		Движение.Количество = Выборка.КоличествоЦБ;
		Движение.Сумма = СебеСтоимость;   
		
		/////  
		 
		Движение = Движения.Прибыль.Добавить();
		Прибыль = Выборка.Сумма - СебеСтоимость;
		Если Прибыль< 0 Тогда 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Прибыль = Прибыль * (-1);
		Иначе	                                         
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;	
	    Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Сумма = Прибыль;
		Движение.НалогУдержан = Ложь;			
	
	КонецЦикла;
	

	// регистр КомиссияБрокера Приход
	Движения.КомиссияБрокера.Записывать = Истина; 

	
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.КомиссияБрокера.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Сумма = ТекСтрокаИнструменты.СуммаКомиссииБрокера;
	КонецЦикла;
	
	// регистр КомиссияБиржи Приход
	Движения.КомиссияБиржи.Записывать = Истина;  
	
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.КомиссияБиржи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Сумма = ТекСтрокаИнструменты.СуммаКомиссииБиржи;
	КонецЦикла;
	
	  
	// Регистр прибыли
	//Движения.Прибыль.Записывать = Истина;
	//Для каждого ТекСтрокаИнструменты Из Инструменты Цикл 
	//	СрСтоимостьЦБ = СрСтоимостьПродаваемыхЦБ.Получить(ТекСтрокаИнструменты.Инструмент);
	//	Движение = Движения.Прибыль.Добавить();
	//	Прибыль = ТекСтрокаИнструменты.Сумма - (СрСтоимостьЦБ*ТекСтрокаИнструменты.КоличествоЦБ);
	//	Если Прибыль< 0 Тогда 
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
	//		Прибыль = Прибыль * (-1);
	//	Иначе	                                         
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	КонецЕсли;	
	//    Движение.Период = Дата;
	//	Движение.БрокерскийСчет = БрокерскийСчет;
	//	Движение.Сумма = Прибыль;
	//	Движение.НалогУдержан = Ложь;		
	//КонецЦикла;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Инструменты.Итог("Сумма") 
					-  Инструменты.Итог("СуммаКомиссииБрокера")
					- Инструменты.Итог("СуммаКомиссииБиржи");
	
КонецПроцедуры
