
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)  
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл с данными|*.xsls;*.csv";
	Ответ = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога); 
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЗагрузитьДанные(Ответ.Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанные(Адрес)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("csv");
	
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	Данные.Записать(ИмяФайла);  
	
	УдалитьИзВременногоХранилища(Адрес);

	_ФоновыйПроцесс.ЗапуститьОбработку(ИмяФайла);  
	
КонецПроцедуры